KanatERPSukhova.КанатАдаптация/src/Documents/ДвижениеПродукцииИМатериалов/ДвижениеПродукцииИМатериалов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="6b652820-7672-43f5-a265-2bed82a309a6">
  <name>ДвижениеПродукцииИМатериалов</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="fd2d4467-c99a-4ae0-9d0c-18b83c88da0a">
    <name>ХозяйственнаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="3f53c0f1-28e1-4b6c-bf6d-4ee84e53f2e7">
    <name>Получатель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="86ff623a-1439-42bc-865c-6d1a6f2310ef">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="580adfdd-4e0f-429d-a6b6-26bbd1c484ae">
    <name>Отправитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="6cc3a6d7-54b4-4e21-af19-24297ed6494a">
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="a24a1454-023d-4c52-b65c-48eac9aa6b26">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

KanatERPSukhova.КанатАдаптация/src/Enums/ХозяйственныеОперации/ХозяйственныеОперации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="351b0c5b-74c3-4aaa-a93b-7246b941f797">
  <name>ХозяйственныеОперации</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="8880d304-daf7-4345-ad8d-c81bc5d994b7">
    <name>РеализацияЧерезКомиссионера</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="4dec627e-3939-4191-a213-0cea734fc86c">
    <name>РеализацияКлиенту</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="f24e8e16-21ad-4eeb-a73d-06152c4d9a1e">
    <name>РеализацияЧерезКомиссионераБезПереходаПраваСобственности</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="a606d3e5-4a59-4b2c-9d3d-5976f5c778cf">
    <name>ПередачаНаКомиссию</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="3299776f-a304-476e-a0d9-a9132b128869">
    <name>РеализацияКлиентуРеглУчет</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="0789d7c2-8020-4d52-a305-445f9faa9b76">
    <name>РеализацияБезПереходаПраваСобственности</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="10db127e-a377-4878-8ead-955d0ff48e4d">
    <name>ПоступлениеОплатыОтКлиента</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="5cb9669e-543b-4d33-b9a2-c6dc788de898">
    <name>ПоставкаПодПринципала</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="af539695-7bf1-4480-85fa-d029bcbfda95">
    <name>ПередачаНаХранениеСПравомПродажи</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="f53b3b31-9cd3-4a9b-b293-626b3a525d66">
    <name>ПередачаМатериаловВКладовую</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="889e8977-08be-4aa4-b9d7-0df860d997ab">
    <name>ПередачаМатериаловВПроизводство</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="f675a52b-940a-480e-8374-c64ff49e4478">
    <name>СборкаТоваров</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

KanatERPSukhova.КанатАдаптация/src/Enums/ТипыНалогообложенияНДС/ТипыНалогообложенияНДС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="492f859c-898a-4672-ab31-9d0ca13acabc">
  <name>ТипыНалогообложенияНДС</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="5df46640-a48c-42a3-84ec-3c9f97ce2844">
    <name>ПродажаНеОблагаетсяНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="507f3953-94e1-46ef-8c8d-0688fd890a1d">
    <name>ПродажаОблагаетсяНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="9f70eac4-2b8c-4400-9fb7-f3d4230ad33e">
    <name>ПродажаНаЭкспорт</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="1270ac55-6965-4dae-b63b-1266cf1cca2a">
    <name>ПродажаОблагаетсяЕНВД</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

KanatERPSukhova.КанатАдаптация/src/Enums/ВариантыПриемкиТоваров/ВариантыПриемкиТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="4ac76022-5cb3-45b4-bcb8-f601c15cee32">
  <name>ВариантыПриемкиТоваров</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="0b878554-7a73-4ff3-b553-ce461e6a2d76">
    <name>РазделенаПоЗаказамИНакладным</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

KanatERPSukhova.КанатАдаптация/src/Enums/СтатусыСборокТоваров/СтатусыСборокТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="d32e7159-13c4-4ac8-9058-9848ec019475">
  <name>СтатусыСборокТоваров</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="73cc6264-ff74-4ff1-a2a7-0fd6e2fc6e85">
    <name>СобраноРазобрано</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

KanatERPSukhova.КанатАдаптация/src/Documents/СборкаТоваров/СборкаТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="600ea876-962e-4c78-bacb-7368e2d7bd87">
  <name>СборкаТоваров</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>КАНАТ_ДвижениеПродукцииИМатериалов</name>
    <type>
      <types>DocumentRef.ДвижениеПродукцииИМатериалов</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="36cdefc1-23ca-4fe3-b864-94f83040a429">
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="8ee6e203-13d7-45c1-a07a-3d9d0e3231bc">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="bd635e04-353a-4d71-8660-cf3ae445ab1c">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="1b378b97-d647-4523-9e40-499cc5cb9eee">
    <name>ХозяйственнаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="4df2676e-97ad-40e1-a0f7-004b51589b67">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="18bd1d8d-c087-4f99-851a-5d41d3f0ed51">
    <name>КоличествоУпаковок</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="aa07f5c4-d5c2-4cb2-9433-e9565f6a27d8">
    <name>СборкаПодДеятельность</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="4fa1b212-5596-4c95-a562-392b50315555">
    <name>Количество</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="2d689016-6760-4f80-9b92-4c3194170afc">
    <name>ВариантПриемкиТоваров</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="52b01363-8774-4cb2-a192-b4017c48be6b">
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="75714917-2443-4e00-97e3-3f32e5c1c870">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="205a5d62-e0bd-4d13-ac4b-344c70e51e4e">
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="173cb865-b4b1-4057-9b23-0a67452e9528">
      <name>Упаковка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="1d46cbbe-be1a-4196-b458-51037d7f1552">
      <name>КоличествоУпаковок</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Document>

KanatERPSukhova.КанатАдаптация/src/Documents/ДвижениеПродукцииИМатериалов/ObjectModule.bsl
&Перед("ОбработкаПроведения")
Процедура КАНАТ_ОбработкаПроведенияПеред(Отказ, РежимПроведения)
	//БИТ_Гурьев_ЧТЗ_3.7_26.02.24++
	Если ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПередачаМатериаловВКладовую
		//ИЛИ ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПередачаМатериаловВПроизводство)
		И Отказ = Ложь Тогда
		
		ОтменитьПроведениеСборокТоваров();
		
	КонецЕсли;
	//БИТ_Гурьев_ЧТЗ_3.7_26.02.24--
КонецПроцедуры

&После("ОбработкаПроведения")
Процедура КАНАТ_ОбработкаПроведенияПосле(Отказ, РежимПроведения)
	//БИТ_Гурьев_ЧТЗ_3.7_26.02.24++
	Если ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПередачаМатериаловВКладовую
		//ИЛИ ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПередачаМатериаловВПроизводство)
		И Отказ = Ложь Тогда
		
		СоздатьСборкуНоменклатурыБезХарактеристик();
		
	КонецЕсли;
	//БИТ_Гурьев_ЧТЗ_3.7_26.02.24--
КонецПроцедуры

//БИТ_Гурьев_ЧТЗ_3.7_26.02.24++
Процедура СоздатьСборкуНоменклатурыБезХарактеристик()
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВариантыКомплектацииНоменклатурыТовары.Номенклатура КАК Номенклатура,
		|	ВариантыКомплектацииНоменклатурыТовары.Характеристика КАК Характеристика,
		|	ВариантыКомплектацииНоменклатуры.Владелец КАК Владелец,
		|	СборкаТоваров.Ссылка КАК СборкаТоваровСсылка,
		|	СУММА(ДвижениеПродукцииИМатериаловТовары.КоличествоУпаковок) КАК КоличествоУпаковок,
		|	СУММА(ДвижениеПродукцииИМатериаловТовары.Количество) КАК Количество,
		|	ДвижениеПродукцииИМатериаловТовары.Упаковка КАК Упаковка, 
		|	ДвижениеПродукцииИМатериаловТовары.Серия,
		|	ДвижениеПродукцииИМатериаловТовары.СтатусУказанияСерий,
		|	СборкаТоваров.Дата КАК СборкаТоваровДата
		|ИЗ
		|	Документ.ДвижениеПродукцииИМатериалов.Товары КАК ДвижениеПродукцииИМатериаловТовары
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВариантыКомплектацииНоменклатуры.Товары КАК ВариантыКомплектацииНоменклатурыТовары
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВариантыКомплектацииНоменклатуры КАК ВариантыКомплектацииНоменклатуры
		|				ЛЕВОЕ СОЕДИНЕНИЕ Документ.СборкаТоваров КАК СборкаТоваров
		|				ПО (СборкаТоваров.КАНАТ_ДвижениеПродукцииИМатериалов = &Ссылка
		|					И СборкаТоваров.Номенклатура = ВариантыКомплектацииНоменклатуры.Владелец
		|					И СборкаТоваров.ПометкаУдаления = Ложь)
		|			ПО (ВариантыКомплектацииНоменклатурыТовары.Ссылка = ВариантыКомплектацииНоменклатуры.Ссылка
		|				И ВариантыКомплектацииНоменклатуры.Основной = Истина
		|				И ВариантыКомплектацииНоменклатуры.ПометкаУдаления = Ложь)
		|		ПО (ДвижениеПродукцииИМатериаловТовары.Номенклатура = ВариантыКомплектацииНоменклатурыТовары.Номенклатура
		|			И ДвижениеПродукцииИМатериаловТовары.Характеристика = ВариантыКомплектацииНоменклатурыТовары.Характеристика)
		|ГДЕ
		|	ДвижениеПродукцииИМатериаловТовары.Ссылка = &Ссылка
		|СГРУППИРОВАТЬ ПО
		|	ВариантыКомплектацииНоменклатурыТовары.Номенклатура,
		|	ВариантыКомплектацииНоменклатурыТовары.Характеристика,
		|	ДвижениеПродукцииИМатериаловТовары.Серия,    
		|	ДвижениеПродукцииИМатериаловТовары.СтатусУказанияСерий,
		|	ВариантыКомплектацииНоменклатуры.Владелец,
		|	СборкаТоваров.Ссылка,
		|	ДвижениеПродукцииИМатериаловТовары.Упаковка,
		|	СборкаТоваров.Дата
		|УПОРЯДОЧИТЬ ПО
		|	СборкаТоваровДата ВОЗР
		|ИТОГИ
		|	СУММА(КоличествоУпаковок),
		|	СУММА(Количество)
		|ПО
		|	Владелец, СборкаТоваровСсылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаВладелец = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаВладелец.Следующий() Цикл
		
		ВыборкаСборкаТоваров = ВыборкаВладелец.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		СборкаТоваровОбъект = Неопределено;
		
		Пока ВыборкаСборкаТоваров.Следующий() Цикл
			
			СборкаТоваровСсылка = ВыборкаСборкаТоваров.СборкаТоваровСсылка;
			
			Если ЗначениеЗаполнено(СборкаТоваровСсылка) Тогда
				
				СборкаТоваровОбъект = СборкаТоваровСсылка.ПолучитьОбъект();
				
			ИначеЕсли СборкаТоваровОбъект = Неопределено Тогда
				
				СборкаТоваровОбъект = Документы.СборкаТоваров.СоздатьДокумент();
				
			Иначе
				
				Продолжить;
				
			КонецЕсли;
			
			СборкаТоваровОбъект.Дата = Дата;
			СборкаТоваровОбъект.Склад = ?(ТипЗнч(Получатель) = Тип("СправочникСсылка.Склады"),
																	Получатель,
																	Справочники.Склады.ПустаяСсылка());
			СборкаТоваровОбъект.Организация = Организация;
			СборкаТоваровОбъект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.СборкаТоваров;
			СборкаТоваровОбъект.Номенклатура = ВыборкаВладелец.Владелец;
			СборкаТоваровОбъект.Комментарий = СтрШаблон("Создано автоматически на основании документа передачи №%1 от %2",
														Номер,
														Дата);
			СборкаТоваровОбъект.КоличествоУпаковок = ВыборкаВладелец.КоличествоУпаковок;
			СборкаТоваровОбъект.Количество = ВыборкаВладелец.Количество;
			СборкаТоваровОбъект.СборкаПодДеятельность = Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС;
			СборкаТоваровОбъект.КАНАТ_ДвижениеПродукцииИМатериалов = Ссылка;
			СборкаТоваровОбъект.ВариантПриемкиТоваров = Перечисления.ВариантыПриемкиТоваров.РазделенаПоЗаказамИНакладным;
			СборкаТоваровОбъект.Статус = Перечисления.СтатусыСборокТоваров.СобраноРазобрано;
			
			СборкаТоваровОбъект.Товары.Очистить();
			ВыборкаДетальныеЗаписи = ВыборкаСборкаТоваров.Выбрать();
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
				Строка = СборкаТоваровОбъект.Товары.Добавить();
				
				ЗаполнитьЗначенияСвойств(Строка, ВыборкаДетальныеЗаписи);
			
			КонецЦикла;
			
		КонецЦикла;
			
		СборкаТоваровОбъект.Записать(РежимЗаписиДокумента.Проведение);
	
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);

КонецПроцедуры //БИТ_Гурьев_ЧТЗ_3.7_26.02.24--

//БИТ_Гурьев_ЧТЗ_3.7_26.02.24++
Процедура ОтменитьПроведениеСборокТоваров()
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СборкаТоваров.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.СборкаТоваров КАК СборкаТоваров
		|ГДЕ
		|	СборкаТоваров.КАНАТ_ДвижениеПродукцииИМатериалов = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СборкаТоваровОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		СборкаТоваровОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры //БИТ_Гурьев_ЧТЗ_3.7_26.02.24--

&После("ОбработкаУдаленияПроведения")
Процедура КАНАТ_ОбработкаУдаленияПроведения(Отказ)
	//БИТ_Гурьев_ЧТЗ_3.7_26.02.24++
	ОтменитьПроведениеСборокТоваров();
	//БИТ_Гурьев_ЧТЗ_3.7_26.02.24--
КонецПроцедуры
